from django.shortcuts import render
from .models import Постачальники, Матеріали, Поставки

def generate_fake_data():
    # Додаємо Постачальників
    Постачальники.objects.create(
        назва_компанії_постачальника='Компанія 1',
        контактна_особа='Контактна Особа 1',
        телефон='1234567890',
        розрахунковий_рахунок='UA12345678901234567890'
    )

    Постачальники.objects.create(
        назва_компанії_постачальника='Компанія 2',
        контактна_особа='Контактна Особа 2',
        телефон='9876543210',
        розрахунковий_рахунок='UA09876543210987654321'
    )

    # Додаємо Матеріали
    Матеріали.objects.create(
        назва_матеріалу='Матеріал 1',
        ціна=10.50
    )

    Матеріали.objects.create(
        назва_матеріалу='Матеріал 2',
        ціна=20.75
    )

    # Додаємо Поставки
    Поставки.objects.create(
        дата_поставки='2023-11-23',
        код_постачальника=1,
        код_матеріалу=1,
        кількість_днів=5,
        кількість_матеріалів=100
    )

    Поставки.objects.create(
        дата_поставки='2023-11-24',
        код_постачальника=2,
        код_матеріалу=2,
        кількість_днів=3,
        кількість_матеріалів=50
    )

def table_view(request):
    # Додаємо випадкові дані тільки, якщо таблиці порожні
    if not Постачальники.objects.exists():
        generate_fake_data()

    # Отримуємо дані з бази даних і передаємо їх у шаблон
    постачальники = Постачальники.objects.all()
    матеріали = Матеріали.objects.all()
    поставки = Поставки.objects.all()

    return render(request, 'myapp/table.html', {'постачальники': постачальники, 'матеріали': матеріали, 'поставки': поставки})
